3.12-exposing-the-brew-service-over-soap-using-cxf/README.md


1. run an app
2. to test soap, make a post request  to 

	http:/localhost:8090/soap

with
	<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://service.prancingdonkey.com/">
			   <soapenv:Header/>
			   <soapenv:Body>
			      <ns:getBrews>		         
			      </ns:getBrews>
			   </soapenv:Body>
			</soapenv:Envelope>